#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
proxmox_lxc.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-carina/lxc/2004]
proxmox_lxc.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-polaris/lxc/2007]
proxmox_lxc.k3s-nfs: Refreshing state... [id=milky-polaris/lxc/12004]
proxmox_vm_qemu.k8s-play-worker: Refreshing state... [id=milky-polaris/qemu/32000]
proxmox_lxc.k3s-lb-3: Refreshing state... [id=milky-polaris/lxc/12003]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-polaris/qemu/2006]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_vm_qemu.k8s-play-controller: Refreshing state... [id=milky-polaris/qemu/31000]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-carina/qemu/11000]
proxmox_lxc.k3s-lb-2: Refreshing state... [id=milky-carina/lxc/12002]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-carina/qemu/1000]
proxmox_vm_qemu.k8s-play-manager-ansible-host: Refreshing state... [id=milky-carina/qemu/30000]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-carina/qemu/10000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_lxc.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/2004"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/2007"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-2 will be updated in-place
  ~ resource "proxmox_lxc" "k3s-lb-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/12002"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-3 will be updated in-place
  ~ resource "proxmox_lxc" "k3s-lb-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/12003"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-nfs is tainted, so must be replaced
-/+ resource "proxmox_lxc" "k3s-nfs" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-polaris/lxc/12004" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:39:F4:49" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:10:B9:4D" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-12004-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (71 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (53 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/10000"
        name                   = "solufit-k3s-controller-1"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/11000"
        name                   = "solufit-k3s-worker-1"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
        tags                   = null
        # (52 unchanged attributes hidden)

      ~ disks {
          + virtio {
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-controller will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-controller" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/31000"
        name                   = "solufit-k8s-playground-controller"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-manager-ansible-host" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/30000"
        name                   = "k8s-play-ansible-host"
        tags                   = null
        # (53 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-worker will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-worker" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/32000"
        name                   = "solufit-k8s-playground-worker"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 15 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*